# 595. Big Countries

There is a table World

+-----------------+------------+------------+--------------+---------------+
| name            | continent  | area       | population   | gdp           |
+-----------------+------------+------------+--------------+---------------+
| Afghanistan     | Asia       | 652230     | 25500100     | 20343000      |
| Albania         | Europe     | 28748      | 2831741      | 12960000      |
| Algeria         | Africa     | 2381741    | 37100000     | 188681000     |
| Andorra         | Europe     | 468        | 78115        | 3712000       |
| Angola          | Africa     | 1246700    | 20609294     | 100990000     |
+-----------------+------------+------------+--------------+---------------+
A country is big if it has an area of bigger than 3 million square km or a population of more than 25 million.

Write a SQL solution to output big countries’ name, population and area.

For example, according to the above table, we should output:

+--------------+-------------+--------------+
| name         | population  | area         |
+--------------+-------------+--------------+
| Afghanistan  | 25500100    | 652230       |
| Algeria      | 37100000    | 2381741      |
+--------------+-------------+--------------+

In [1]:
import pandas as pd
import re
import numpy as np
World= pd.DataFrame({'name':['Afghanistan','Albania ','Algeria',' Andorra','Angola'],'continent':['Asia','Europe','Africa',
'Europe','Africa'],'area':[ 652230,28748,2381741,468,1246700],'population':[25500100,2831741,37100000,78115,20609294],'gdp':
[20343000,12960000,188681000,3712000,100990000]})
World=World[['name','continent','area','population','gdp']]
World

          name continent     area  population        gdp
0  Afghanistan      Asia   652230    25500100   20343000
1     Albania     Europe    28748     2831741   12960000
2      Algeria    Africa  2381741    37100000  188681000
3      Andorra    Europe      468       78115    3712000
4       Angola    Africa  1246700    20609294  100990000

In [7]:
output=World[(World.area>3000000)|(World.population >25000000)][['name','population','area']]
output

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

In [8]:
print(output.to_string(index=False))

name  population     area
Afghanistan    25500100   652230
    Algeria    37100000  2381741

# 596. Classes more than 5 Students

There is a table courses with columns: student and class

Please list out all classes which have more than or equal to 5 students.

For example, the table:

+---------+------------+
| student | class      |
+---------+------------+
| A       | Math       |
| B       | English    |
| C       | Math       |
| D       | Biology    |
| E       | Math       |
| F       | Computer   |
| G       | Math       |
| H       | Math       |
| I       | Math       |
+---------+------------+
Should output:

+---------+
| class   |
+---------+
| Math    |
+---------+

In [9]:
import pandas as pd
import re
import numpy as np
courses= pd.DataFrame({'student':['A','B','C','D','E','F','G','H','I'],'class':['Math','English','Math','Biology','Math',
    'Computer','Math','Math','Math']})
courses=courses[['student','class']]
courses

  student     class
0       A      Math
1       B   English
2       C      Math
3       D   Biology
4       E      Math
5       F  Computer
6       G      Math
7       H      Math
8       I      Math

In [24]:
ouput=courses.groupby('class').size().to_frame('cc').reset_index()
ouput

      class  cc
0   Biology   1
1  Computer   1
2   English   1
3      Math   6

In [31]:
print(ouput[ouput.cc>=5][['class']].to_string(index=False))

class
Math

# 597. Friend Requests I: Overall Acceptance Rate

In social network like Facebook or Twitter, people send friend requests and accept others’ requests as well. Now given two
tables as below:

Table: friend_request

sender_id	send_to_id	request_date
1	        2	        2016_06-01
1	        3	        2016_06-01
1	        4	        2016_06-01
2	        3	        2016_06-02
3	        4	        2016-06-09
Table: request_accepted

requester_id	accepter_id	accept_date
1	            2	        2016_06-03
1	            3	        2016-06-08
2	            3	        2016-06-08
3	            4	        2016-06-09
3	            4	        2016-06-10
Write a query to find the overall acceptance rate of requests rounded to 2 decimals, which is the number of acceptance
divide the number of requests.
For the sample data above, your query should return the following result.

accept_rate
0.80

In [9]:
import pandas as pd
import re
import numpy as np
friend_request=pd.DataFrame({'sender_id':[1,1,1,2,3],'send_to_id':[2,3,4,3,4],'request_date':['2016_06-01','2016_06-01',
'2016_06-01','2016_06-02','2016_06-09']})
friend_request=friend_request[['sender_id','send_to_id','request_date']]
friend_request

   sender_id  send_to_id request_date
0          1           2   2016_06-01
1          1           3   2016_06-01
2          1           4   2016_06-01
3          2           3   2016_06-02
4          3           4   2016_06-09

In [27]:
friend_request['concat1']=friend_request.sender_id.astype(str)+friend_request.send_to_id.astype(str)
friend_request

   sender_id  send_to_id request_date concat1
0          1           2   2016_06-01      12
1          1           3   2016_06-01      13
2          1           4   2016_06-01      14
3          2           3   2016_06-02      23
4          3           4   2016_06-09      34

In [28]:
friend_request.concat1.nunique()

5

In [29]:
type(friend_request.concat1.count())

numpy.int32

In [30]:
 request_accepted=pd.DataFrame({'requester_id':[1,1,2,3,3],'accepter_id':[2,3,3,4,4],'accept_date':['2016_06-03','2016_06-08',
'2016_06-08','2016_06-09','2016_06-10']})
request_accepted= request_accepted[['requester_id','accepter_id','accept_date']]
request_accepted

   requester_id  accepter_id accept_date
0             1            2  2016_06-03
1             1            3  2016_06-08
2             2            3  2016_06-08
3             3            4  2016_06-09
4             3            4  2016_06-10

In [31]:
request_accepted['concat']=request_accepted.requester_id.astype(str)+request_accepted.accepter_id.astype(str)
request_accepted

   requester_id  accepter_id accept_date concat
0             1            2  2016_06-03     12
1             1            3  2016_06-08     13
2             2            3  2016_06-08     23
3             3            4  2016_06-09     34
4             3            4  2016_06-10     34

In [32]:
request_accepted.concat.nunique()

4

In [34]:
data = [request_accepted.concat.nunique()/friend_request.concat1.nunique()]
output= pd.DataFrame(data, columns=['rate'])
output

   rate
0   0.8

In [35]:
print(output.to_string(index=False))

rate
 0.8